# dropna

In [2]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
                 {"name": ['Alfred', 'Batman', 'Catwoman'],         
                  "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                  "born": [pd.NaT, pd.Timestamp("1940-04-25") ,pd.NaT]}
                 )
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [3]:
df.dropna() #把有缺失值的'列'去掉

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [4]:
df.dropna(axis = 1) #把有缺失值的'行'去掉

       name
0    Alfred
1    Batman
2  Catwoman

In [7]:
df.dropna(how = 'all') #所有值都缺失才刪除(any = 只要有缺失就刪除)

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [9]:
df.dropna(thresh = 2 ) #如果該列缺失值大於等於thresh，則刪除該列

       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [11]:
df.dropna(subset = ['name','toy'] ) #在哪些列中檢視是否有缺失值

       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

# drop

In [13]:
df = pd.DataFrame(np.arange(12).reshape(3,4),                 
                  columns=['A', 'B', 'C', 'D'])
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [16]:
df.drop([0]) #刪除列(axis=0,預設)

   A  B   C   D
1  4  5   6   7
2  8  9  10  11

In [18]:
df.drop(['A','D'] ,axis = 1) #刪除行

   B   C
0  1   2
1  5   6
2  9  10

# fillna

In [21]:
f = pd.DataFrame([[np.nan, 2, np.nan, 0],
                   [3, 4, np.nan, 1],
                   [np.nan, np.nan, np.nan, 5],
                   [np.nan, 3, np.nan, 4]],
                   columns=list('ABCD'))
f

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

In [24]:
f.fillna(17) #用17填補所有空值

      A     B     C  D
0  17.0   2.0  17.0  0
1   3.0   4.0  17.0  1
2  17.0  17.0  17.0  5
3  17.0   3.0  17.0  4

In [25]:
f.fillna(method='ffill') #觀點為行，上補下之空值

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  3.0  4.0 NaN  5
3  3.0  3.0 NaN  4

In [26]:
f.fillna(method='ffill',axis = 1) #觀點為列，左補右之空值

     A    B    C    D
0  NaN  2.0  2.0  0.0
1  3.0  4.0  4.0  1.0
2  NaN  NaN  NaN  5.0
3  NaN  3.0  3.0  4.0

In [27]:
f.fillna(method='bfill') #觀點為行，下補上之空值

     A    B   C  D
0  3.0  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  3.0 NaN  5
3  NaN  3.0 NaN  4

In [28]:
values = {'A': 0, 'B': 1, 'C': 2, 'D': 3} #每一column用不同值填補
f.fillna(value=values)

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  0.0  1.0  2.0  5
3  0.0  3.0  2.0  4

In [29]:
values = {'A': 0, 'B': 1, 'C': 2, 'D': 3} #每一column用不同值填補，但limit用來侷限範圍
f.fillna(value=values, limit=1) #

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  NaN  1
2  NaN  1.0  NaN  5
3  NaN  3.0  NaN  4